In [45]:
import numpy as np
import pandas as pd
pd.set_option("display.max_columns", None)

In [8]:
bank_df = pd.read_csv("../data/raw/bank-additional.csv")
bank_df.head()

,Unnamed: 0,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [3]:
bank_df.shape

(43000, 24)

In [4]:
bank_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43000 entries, 0 to 42999
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      43000 non-null  int64
 1   age             37880 non-null  float64
 2   job             42655 non-null  object
 3   marital         42915 non-null  object
 4   education       41193 non-null  object
 5   default         34019 non-null  float64
 6   housing         41974 non-null  float64
 7   loan            41974 non-null  float64
 8   contact         43000 non-null  object
 9   duration        43000 non-null  int64
 10  campaign        43000 non-null  int64
 11  pdays           43000 non-null  int64
 12  previous        43000 non-null  int64
 13  poutcome        43000 non-null  object
 14  emp.var.rate    43000 non-null  float64
 15  cons.price.idx  42529 non-null  object
 16  cons.conf.idx   43000 non-null  object
 17  euribor3m       33744 non-null  object
 18  nr.employed     43000 non-null  object
 19  y               43000 non-null  object
 20  date            42752 non-null  object
 21  latitude        43000 non-null  float64
 22  longitude       43000 non-null  float64
 23  id_             43000 non-null  object
dtypes: float64(7), int64(5), object(12)
memory usage: 7.9+ MB

In [5]:
bank_df.isnull().sum()

Unnamed: 0           0
age               5120
job                345
marital             85
education         1807
default           8981
housing           1026
loan              1026
contact              0
duration             0
campaign             0
pdays                0
previous             0
poutcome             0
emp.var.rate         0
cons.price.idx     471
cons.conf.idx        0
euribor3m         9256
nr.employed          0
y                    0
date               248
latitude             0
longitude            0
id_                  0
dtype: int64

In [6]:
bank_df["y"].unique()

array(['no', 'yes'], dtype=object)

In [7]:
bank_df["pdays"].unique()

array([999,   6,   4,   3,   5,   1,   0,  10,   7,   8,   9,  11,   2,
        12,  13,  14,  15,  16,  21,  17,  18,  22,  25,  26,  19,  27,
        20])

In [14]:
bank_df["pdays"].value_counts(normalize=True)

pdays
999    0.963070
3      0.010628
6      0.009953
4      0.002814
9      0.001558
7      0.001535
2      0.001465
12     0.001419
10     0.001279
5      0.001163
13     0.000884
11     0.000698
15     0.000605
1      0.000605
14     0.000512
8      0.000465
0      0.000349
16     0.000302
17     0.000233
18     0.000163
22     0.000093
19     0.000070
21     0.000047
25     0.000023
26     0.000023
27     0.000023
20     0.000023
Name: proportion, dtype: float64

In [21]:
not_contacted = bank_df[bank_df["pdays"] == 999]
not_contacted["y"].value_counts(normalize=True)

y
no     0.907587
yes    0.092413
Name: proportion, dtype: float64

In [22]:
contacted = bank_df[bank_df["pdays"] != 999]
contacted["y"].value_counts(normalize=True)

y
yes    0.640428
no     0.359572
Name: proportion, dtype: float64

In [ ]:
contacted["previous"].value_counts( )

previous
1    902
2    421
3    180
4     62
5     18
6      4
7      1
Name: count, dtype: int64

In [44]:
conversion_contacts = contacted.groupby("previous")["y"].value_counts(normalize=True).reset_index(name="conversion_rate")
conversion_contacts

    previous    y  conversion_rate
0          1  yes         0.595344
1          1   no         0.404656
2          2  yes         0.698337
3          2   no         0.301663
4          3  yes         0.722222
5          3   no         0.277778
6          4  yes         0.612903
7          4   no         0.387097
8          5  yes         0.833333
9          5   no         0.166667
10         6  yes         0.750000
11         6   no         0.250000
12         7   no         1.000000